#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=b82f08c474da3ac3867bab4915f23c2a2653ba19]
local_file.tfkey: Refreshing state... [id=7c0c732a82739692968e1c48ee30ce17d8d118d2]
aws_vpc.main: Refreshing state... [id=vpc-0f0937681e2a03404]
data.aws_ami.java_ami: Reading...
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0ed3fe0aa6660aaf7]
data.aws_ami.java_ami: Read complete after 1s [id=ami-05f9fdacb4f4ec950]
aws_security_group.allow_http: Refreshing state... [id=sg-05be6488e8f968018]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-044aeee947e08bce0]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0937bfb563428bfe9]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0cdfe3aae56d99be7]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-052fb1d6dc8f7ac0a]
aws_security_group.allow_ssh: Refreshing state... [id=sg-04622f925cc8baa22]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-09544529ed29bef83]
aws_security_group.elb: Refreshing state... [id=sg-055535bfe143cdce7]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-053b44dbf2b242f0d]
aws_instance.bastion-host: Refreshing state... [id=i-0857d97b71c928e4b]
aws_route_table.public_route_table: Refreshing state... [id=rtb-07cb130dbaf445768]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20230125170502049700000001]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table.private_route_table: Refreshing state... [id=rtb-00a63ca5443541aad]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-018d333edd57297bd]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-06a5b649bc9f32edc]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-03fc774b1c5170a5f]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0e73ad4d75f927c75]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_autoscaling_group.auto_scaling_group has been deleted
  - resource "aws_autoscaling_group" "auto_scaling_group" {
      - id                        = "Auto Scaling Group" -> null
        name                      = "Auto Scaling Group"
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = (known after apply)
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be created
  + resource "aws_autoscaling_group" "auto_scaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "Auto Scaling Group"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-044aeee947e08bce0",
          + "subnet-052fb1d6dc8f7ac0a",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "App Server"
        }
    }

  # aws_launch_configuration.ec2_config must be replaced
+/- resource "aws_launch_configuration" "ec2_config" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:402135063963:launchConfiguration:8e133973-dec2-4292-b36f-2473dc2d5cab:launchConfigurationName/terraform-20230125170502049700000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20230125170502049700000001" -> (known after apply)
      ~ image_id                         = "ami-06502636b721ace34" -> "ami-05f9fdacb4f4ec950" # forces replacement
      ~ name                             = "terraform-20230125170502049700000001" -> (known after apply)
      ~ name_prefix                      = "terraform-" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*